{
  "header": {
    "name": "Елізавета Іванушанка",
    "position": "Junior Frontend-распрацоўнік ",
    "location": "Санкт-Пецярбург, Расія"
  },
  "nav": {
    "about": "Пра мяне",
    "skills": "Навыкі",
    "projects": "Праекты"
  },
  "about": {
    "pageTitle": "Пра мяне",
    "content": {
      "text1": "Я шукаю першую працу ў ролі frontend-распрацоўніка.",
      "text2": "На сваёй мінулай працы я займалася пытаннямі дастаўкі і мытнага афармлення тавараў у невялікай гандлёвай кампаніі. Аднойчы я зразумела, што прысвячаю занадта шмат часу адной часта паўтаральнай задачы і вырашыла гэта аптымізаваць. З дапамогай ведаў з курсу інфарматыкі ў універсітэце напалову са stackoverflow я напісала свой калькулятар разліку параметраў дастаўкі тавара. Праграма атрымалася не без багаў, але ж нягледзячы на гэта, як яна эканоміла мне час! Ад той пары мяне пастаянна пераследвала пытанне, чым я сапраўды хачу займацца на працы.",
      "text3": "Пераломным момантам у рашэнні змяніць дзейнасць стаў пераезд з Мінска ў Санкт-Пецярбург. Я далучылася да курсу па фронтэнду ад кам'юніці <a href='https://rs.school/' class='link' target='_blank'>Rolling Scopes School</a>, прысвячаючы ўвесь свой час навучанню.",
      "text4":"Гэтая школа - неверагодная супольнасць натхнёных людзей, блізкіх мне па духу. Разам мы справіліся з вялікай колькасцю таскаў, вучыліся працаваць ва ўмовах жорсткіх дэдлайнаў, даведаліся што такое распрацоўка ў камандзе і як важна і неабходна ўмець карыстацца Git. Таксама менавіта тут я падсела на задачкі з <a href='https://www.codewars.com/users/lisaliza6428'  class='codewars-link' target='_blank'>Codewars.com</a>, дзе ў мяне 4 kyu ;) <a class='codewars' target='_blank' href='https://www.codewars.com/users/lisaliza6428'><img class='codewars-img' src='https://www.codewars.com/users/lisaliza6428/badges/micro' alt=''/></a>",
      "text5": "Больш за ўсё ў вэб-распрацоўцы мяне натхняе неабмежаваная магчымасць ствараць крутыя рэчы любой складанасці з дапамогай ўсяго толькі аднаго ноўтбука і галоўнае - адразу  бачыць вынік сваіх дзеянняў. Мне складана сказаць, што я люблю больш - кодзіць або вярстаць. Суадносіны 50/50 былі б для мяне ідэальныя ў працы.",
      "text6": "У дадзены момант пішу на Angular, але ў выпадку чаго гатовая асвоіць любы іншы фрэймворк ці бібліятэку.",
      "text7":"Мару стаць часткай праекта і каманды, дзе ў мяне будзе магчымасць ўжываць свае навыкі, пераймаць вопыт калегаў і станавіцца больш кампетэнтным спецыялістам."
    },
    "download": "Скачаць CV (PDF)"
  },
  "skills": {
    "pageTitle": "Навыкі:",
    "certificates": "Сертыфікаты:",
    "skills": {
      "technologies":{
        "title": "Тэхналогіі",
        "list": {
          "item1": "JavaScript (ES6+)",
          "item2": "HTML",
          "item3": "CSS/SASS",
          "item4": "TypeScript",
          "item5": "Angular"
        }
      },
      "concepts":{
        "title": "Канцэпцыі",
        "list": {
          "item1": "HTTP, REST API",
          "item2": "WebStorage",
          "item3": "Event loop",
          "item4": "Алгарытмы",
          "item5": "Структуры даных",
          "item6": "ООР",
          "item7": "BEM",
          "item8": "Семантычная верстка",
          "item9": "Адаптыўная верстка"
        }
      },
      "tools":{
        "title": "Інструменты",
        "list": {
          "item1": "IDE VSCode",
          "item2": "NPM, Webpack",
          "item3": "Git & GitHub",
          "item4": "DevTools",
          "item5": "Figma",
          "item6": "Perfect Pixel",
          "item7": "Postman"
        }
      },
      "langs":{
        "title": "Мовы",
        "list": {
          "item1": "Руская",
          "item2": "Беларуская",
          "item3": "Англійская - B1"
        }
      }
    }
  },
  "projects": {
    "pageTitle": "Праекты",
    "museum": {
      "title": "Музей Луўра",
      "stack": "Стэк: HTML, SASS, Javascript",
      "descr1": "Гэта альтэрнатыўная версія сайта <a class='louvre-link' target='_blank' href='https://www.louvre.fr/en'>Музея Луўра</a> у Парыжы.",
      "descr2": "У праекце рэалізаваны: слайдэр (у секцыі Welcome), слайдэр да/пасля (у секцыі Explore), кастомный відэаплэер, карцінная галерэя з анімацыяй, калькулятар разліку кошту квіткоў, форма куплі квіткоў з валідацыяй палёў уводу (даступная па націску кнопкі \"Buy Now\" у секцыі Tickets), секцыя з эфектам паралакса і інтэрактыўная карта (падключаная з дапамогай <a class='mapbox-link' target='_blank' href='https://www.mapbox.com/'>Mapbox.com</a>).",
      "descr3": "Сайт адаптыўны для прылад з пашырэннем экрана ад 320px да 1920px."
    },
    "artquiz": {
      "title": "Віктарына ArtQuiz",
      "stack": "Стэк: Angular, TypeScript",
      "descr1": "Гэта SPA ўяўляе сабой гульню з двума рэжымамі: адгадаць мастака або адгадаць карціну. Пасля раўнда гульні становіцца даступнай старонка з вынікамі, дзе адлюстроўваюцца вашы правільныя і няправільныя адказы. Вынікі захоўваюцца ў LocalStorage браўзера.",
      "descr2": "З галоўнай старонкі гульні можна трапіць на старонку з наладамі. Тут можна ўключыць / выключыць гульню на час, змяніць гучнасць гукаў або скінуць свой прагрэс.",
      "descr3": "Старонка галерэі створана з выкарыстаннем ngx-pagination. Тут вы можаце даследаваць шэдэўры жывапісу і сартаваць іх так, як вам зручна.",
      "descr4": "Вэб-прыкладанне адаптыўна для прылад з пашырэннем экрана ад 320px да 1920px."
    },
    "cv": {
      "title": "Гэта CV-старонка",
      "stack": "Стэк: Angular, TypeScript",
      "descr1": "Мая першая прылада, створаная на Angular.",
      "descr2": "У праладзе рэалізаваны роуцінг і лакалізацыя на трох мовах з дапамогай ngx-translate.",
      "descr3": "Сайт адаптыўны для прылад з пашырэннем экрана ад 320px да 1920px."
    },
    "buttonDeploy": "Deploy",
    "buttonCode": "Код"
  },
  "errorPage": {
    "text": "Нешта пайшло не так!",
    "link": "Перайсці на галоўную старонку"
  }
}