{
  "header": {
    "name": "Елизавета Иванушенко",
    "position": "Junior Frontend-разработчик",
    "location": "Санкт-Петербург, Россия"
  },
  "nav": {
    "about": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты"
  },
  "about": {
    "pageTitle": "Обо мне",
    "content": {
      "text1": "Я свитчер и ищу первую работу в роли frontend-разработчика.",
      "text2": "На своей прошлой работе я занималась вопросами доставки и таможенного оформления товаров в небольшой торговой компании. Однажды я поняла, что трачу слишком много времени на одну часто повторяющуюся рабочую задачу и решила это оптимизировать. С помощью кое-каких знаний из курса информатики в университете пополам со stackoverflow я написала свой калькулятор расчета параметров доставки заказа. Программа получилась не без изъянов и багов, но несмотря на это, как же она экономила мне время! С тех пор меня постоянно преследовал вопрос, чем я действительно хочу заниматься на работе.",
      "text3": "Переломным моментом в решении сменить деятельность стал переезд из Минска в Санкт-Петербург. Я присоединилась к курсу по фронтенду от комьюнити <a href='https://rs.school/' class='link' target='_blank'>Rolling Scopes School</a>, посвящая всё свое время обучению.",
      "text4":"Здесь я оказалась в невероятном сообществе целеустремленных и вдохновленных людей, близких мне по духу. Вместе мы справились с огромным количеством тасков, учились работать в условиях жестких дедлайнов, узнали что такое разработка в команде и как важно и необходимо уметь пользоваться гитом. Также именно здесь я подсела на задачки с <a href='https://www.codewars.com/users/lisaliza6428'  class='codewars-link' target='_blank'>Codewars.com</a>, где у меня 4 kyu ;) <a class='codewars' target='_blank' href='https://www.codewars.com/users/lisaliza6428'><img class='codewars-img' src='https://www.codewars.com/users/lisaliza6428/badges/micro' alt=''/></a>",
      "text5": "Больше всего в веб-разработке меня вдохновляет неограниченная возможность создавать крутые вещи любой сложности с помощью всего лишь одного ноутбука и главное – сразу же видеть результат своих действий. Мне сложно сказать, что я люблю больше – кодить или верстать. Соотношение 50/50 было бы для меня идеальным в работе.",
      "text6": "В данный момент пишу на Angular, но в случае чего готова освоить любой другой фреймворк или библиотеку.",
      "text7":"Мечтаю стать частью проекта и команды, где я смогу применять свои навыки, перенимать опыт коллег и становиться более компетентным специалистом."
    },
    "download": "Скачать CV (PDF)"
  },
  "skills": {
    "pageTitle": "Навыки:",
    "certificates": "Сертификаты:",
    "skills": {
      "technologies":{
        "title": "Технологии",
        "list": {
          "item1": "JavaScript (ES6+)",
          "item2": "HTML",
          "item3": "CSS/SASS",
          "item4": "TypeScript",
          "item5": "Angular"
        }
      },
      "concepts":{
        "title": "Концепции",
        "list": {
          "item1": "HTTP, REST API",
          "item2": "WebStorage",
          "item3": "Event loop",
          "item4": "Алгоритмы",
          "item5": "Структуры данных",
          "item6": "ООП",
          "item7": "BEM",
          "item8": "Семантическая верстка",
          "item9": "Адаптивная верстка"
        }
      },
      "tools":{
        "title": "Инструменты",
        "list": {
          "item1": "IDE VSCode",
          "item2": "NPM, Webpack",
          "item3": "Git & GitHub",
          "item4": "DevTools",
          "item5": "Figma",
          "item6": "Perfect Pixel",
          "item7": "Postman"
        }
      },
      "langs":{
        "title": "Языки",
        "list": {
          "item1": "Русский",
          "item2": "Беларусский",
          "item3": "Английский - B1"
        }
      }
    }
  },
  "projects": {
    "pageTitle": "Проекты",
    "museum": {
      "title": "Музей Лувра",
      "stack": "Стек: HTML, SASS, Javascript",
      "descr1": "Это альтернативная версия сайта  <a class='louvre-link' target='_blank' href='https://www.louvre.fr/en'>Музея Лувра</a> в Париже.",
      "descr2": "В проекте реализованы: слайдер (в секции Welcome), слайдер до/после (в секции Explore), кастомный видеоплеер, картинная галерея с анимацией, калькулятор расчета стоимости билетов, форма покупки билетов с валидацией полей ввода (доступна по нажатию кнопки  \"Buy Now\" в секции Tickets), секция с эффектом параллакса и интерактивная карта (подключена с помощью <a class='mapbox-link' target='_blank' href='https://www.mapbox.com/'>Mapbox.com</a>).",
      "descr3": "Сайт адаптивен для устройств с расширением экрана от 320px до 1920px."
    },
    "artquiz": {
      "title": "Викторина ArtQuiz",
      "stack": "Стек: Angular, TypeScript",
      "descr1": "Это SPA представляет собой игру с двумя режимами: угадать художника или угадать картину. После сыгранного раунда становится доступной страница с результатами, где отображаются ваши правильные и неправильные ответы. Результаты сохраняются в LocalStorage браузера.",
      "descr2": "С главной страницы приложения можно попасть на страницу с настройками. Здесь можно включить/выключить игру на время, изменить громкость звуков или сбросить свой прогресс.",
      "descr3": "Страница галереи создана с использованием ngx-pagination. Здесь вы можете исследовать шедевры, сортируя их так, как вам удобно.",
      "descr4": "Приложение адаптивно для устройств с расширением экрана от 320px до 1920px."
    },
    "cv": {
      "title": "Эта CV-страница",
      "stack": "Стек: Angular, TypeScript",
      "descr1": "Мое первое приложение, созданное с помощью Angular.",
      "descr2": "В приложении реализован роутинг и локализация на трех языках с помощью ngx-translate.",
      "descr3": "Приложение адаптивно для устройств с расширением экрана от 320px до 1920px."
    },
    "buttonDeploy": "Деплой",
    "buttonCode": "Код"
  },
  "errorPage": {
    "text": "Что-то пошло не так!",
    "link": "Перейти на главную страницу"
  }
}